module.exports = {
  up: async (queryInterface, Sequelize) => {
    const toursData = [
      {
        name: 'Прогулка на байкал',
        price: 500,
        description:
          'Приглашаем в комфортный тур по зимнему Байкалу. В это время года Байкал преображается до неузнаваемости. Лед обретает магические формы – словно вы очутились в холодной сказке о снежной королеве. В нашем туре по льду Байкала мы сможем прикоснуться к этой красоте, вдоволь насладиться завораживающими пейзажами, покататься на коньках, полазить в ледяных гротах и встретить удивительные закаты!',
        authorId: 1,
        catTId: 1, // Пеший поход
        location: 'Байкал',
        date: '2024-01-15',
        endDate: '2024-01-30',
        places: 10,
        pathImg: 'baikalPeshiy.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'Прогулка на байдарках по реке КЛЯЗЬМА',
        price: 600,
        description:
          'Сплав в ранней весной или поздней осенью — отличный выбор для тех, кто хочет попробовать себя в экстремальных условиях, но сомневается, ведь после холодной сплавной части вас ждет уютный отапливаемый шатер, баня, вкусная еда и самые теплые беседы.',
        authorId: 2,
        catTId: 2, // Сплав
        location: 'Подмосковье',
        date: '2024-08-10',
        endDate: '2024-08-20',
        places: 8,
        pathImg: 'splavMSC.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'БОЛЬШОЙ КАВКАЗСКИЙ ТРИП: ЧЕЧНЯ + ДАГЕСТАН',
        price: 600,
        description:
          'Да, да, да, это Кавказ! От современной развивающейся столицы Чечни - Грозного до одного из древнейших городов мира и визитной карточки Дагестана - Дербента. Большой кавказский трип объединяет в себе посещение самых топовых локаций двух кавказских регионов.',
        authorId: 2,
        catTId: 3, // ДжипТур
        location: 'Дагестан',
        date: '2024-10-10',
        endDate: '2024-10-20',
        places: 8,
        pathImg: 'dzhipDagestan.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'ПО ЦЕНТРУ ПИТЕРА НА КАЯКАХ',
        price: 600,
        description:
          'Исторический центр Питера ранним утром, пока город ещё спит — это особенная атмосфера. Мы пройдём по каналу Грибоедова, дойдём до Казанского собора, Спаса на Крови и по реке Мойка вернёмся обратно мимо Юсуповского дворца.',
        authorId: 2,
        catTId: 4, // КаякТур
        location: 'Санкт-Петербург',
        date: '2024-05-13',
        endDate: '2024-05-13',
        places: 8,
        pathImg: 'ka9kPiter.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'ЛЕСТНИЦА В НЕБО. АЛЬПЛАГЕРЬ УЛЛУ-ТАУ ВМЕСТЕ С ДЕТЬМИ',
        price: 600,
        description:
          'Про Эльбрус слышал, наверное, каждый, а вот многие ли знают ущелье Адыр-Су? А ведь это один из  прекраснейших уголков Кабардино-Балкарии!',
        authorId: 2,
        catTId: 5, // Альпинизм
        location: 'Подмосковье',
        date: '2024-08-10',
        endDate: '2024-08-20',
        places: 8,
        pathImg: 'alpinism.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'СЧАСТЬЕ, МОРЕ, ГОРЫ, ЙОГА',
        price: 600,
        description:
          'Для тех, кто хочет попробовать, что такое кундалини йога, перезагрузиться, отдохнуть и расслабиться телом и душой от привычной суеты, совместить приятные физические нагрузки с морем и увлекательными экскурсиями, наполниться энергией, улучшить самочувствие и физическую форму, провести время в дружественной компании единомышленников. Вы сможете насладиться занятиями йогой с видом на горы и море, узнаете об истории и философии йоги, а также сможете каждый день купаться, загорать и угощаться свежими фруктами прямо с деревьев!',
        authorId: 2,
        catTId: 6, // Другое
        location: 'Подмосковье',
        date: '2024-08-10',
        endDate: '2024-08-20',
        places: 8,
        pathImg: 'yoga.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'ПЕШИЙ ПОХОД «МИНУС ДВА»',
        price: 500,
        description:
          'По многочисленным просьбам мы сделали специальный маршрут для любителей трудностей.Много-много километров, немного еды и минус два килограмма веса в воскресенье вечером вас не удивят.Маршрут проходит по красивейшим местам Владимирской и Московских областей, так что мы ещё и природой насладимся.',
        authorId: 1,
        catTId: 1, // Пеший поход
        location: 'Куровское',
        date: '2024-01-15',
        endDate: '2024-01-30',
        places: 10,
        pathImg: 'peshiy2.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'Дальний кордон',
        price: 600,
        description: `6 часов превосходного бездорожьяЭнергетический завтрак
Вкуснейший обед на свежем воздухе
        Море кайфа и адреналина
        Заряд положительных эмоци`,
        authorId: 2,
        catTId: 3, // ДжипТур
        location: 'Дагестан',
        date: '2024-10-10',
        endDate: '2024-10-20',
        places: 8,
        pathImg: 'dzhip2.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'Сплав на каяках по реке ИСТРА',
        price: 600,
        description: `Активный отдых для людей, ищущих
          не только развлечения, но и здоровой, спортивной нагрузки, впечатлений от новых мест и возможности вырваться из города на природу
          Возможность самостоятельно, без инструктора, только со своей компанией провести несколько часов на реке, на природе, в красивейших местах Подмосковья.`,
        authorId: 2,
        catTId: 4, // КаякТур
        location: 'Истра',
        date: '2024-05-13',
        endDate: '2024-05-13',
        places: 8,
        pathImg: 'kaykai2.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'КАМЧАТСКИЙ ВОЯЖ: ВОСХОЖДЕНИЯ, ПРОГУЛКИ И РЕЛАКС НА ЮГЕ (ПРОЖИВАНИЕ НА БАЗЕ ОТДЫХА)',
        price: 600,
        description:
          'Камчатка — место для романтиков и искателей приключений. Вулканы, гейзеры, термальные источники — полуостров будто специально создан для активного отдыха. Чтобы увидеть эти чудеса природы, необязательно терпеть лишения. Если вы хотите путешествовать по Камчатке с комфортом, тур можно приобрести в "Клубе Приключений", куда можно отправиться всей семьей, включая детей.',
        catTId: 5, // Альпинизм
        location: 'Подмосковье',
        date: '2024-08-10',
        endDate: '2024-08-20',
        places: 8,
        pathImg: 'apl2.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        name: 'КУБА: НЕЗАБЫВАЕМОЕ ПУТЕШЕСТВИЕ',
        price: 600,
        description:
          'Стать абсолютно свободным, окрылить своё сердце и окунуться в неповторимую атмосферу сумасбродной, весёлой и открытой сердцем Кубы. Вам придётся расстаться со всеми существующими предрассудками, познавать и принимать эту страну такой, какая она есть. Так Куба сможет остаться в вашем сердце на всю жизнь.',
        authorId: 2,
        catTId: 6, // Другое
        location: 'Подмосковье',
        date: '2024-08-10',
        endDate: '2024-08-20',
        places: 8,
        pathImg: 'yoga.jpg',
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      // Добавьте еще записи для остальных категорий
      // ...
    ];

    const promises = toursData.map((tour) => queryInterface.bulkInsert('Tours', [tour], {}));

    await Promise.all(promises);
  },

  down: async (queryInterface, Sequelize) => {
    await queryInterface.bulkDelete('Tours', null, {});
  },
};
