module.exports = {
  up: async (queryInterface, Sequelize) => {
    await queryInterface.bulkInsert(
      'Equipment',
      [
        {
          name: 'Палатка Zelenoe More Takora 2+',
          price: 1000,
          description:
            'Двухместная палатка Takora 2+ разработана для любителей пеших походов или велосипедных путешествий в летнее, весеннее и осеннее время. Пригодятся они также мотоциклистам, и охотникам.',
          userId: 1,
          catEId: 1,
          pathImg: 'takora2.jpeg',
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          name: 'Рюкзак Tramp Thor 90+10',
          price: 500,
          description:
            'Универсальный туристический рюкзак Tramp объемом 90+10 литров для пеших и горных походов (треккингов), продолжительных экспедиций и альпинистских восхождений различной сложности. Надежная, тщательно продуманная и вместительная по объему модель современного туристического рюкзака. Конструкция рюкзака разработана с учетом опыта и рекомендаций профессиональных туристов и опытных путешественников.',
          userId: 2,
          catEId: 2,
          pathImg: 'tramp.png',
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          name: 'Спальный мешок AceCamp Thermal Bag 3808',
          price: 800,
          description: 'Компактный экстренный спальный мешок для тепловой защиты. Сварные швы - без швов и клея. Отражает тепло вашего тела. Ветро и влаго непроницаемый. Используется отдельно, а так же внутри или снаружи основного спальника. Спальный мешок позволит перенести сильные холода, сохранив при этом силы и способность активных действий. Состав: алюминизированный полиэтилен.',
          userId: 3,
          catEId: 3,
          pathImg: 'meshok1.jpeg',
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          name: 'Кухня походная BTrace Duet',
          price: 1500,
          description: 'Это самая большая и удобная кухня в ассортименте BTrace. У неё полноценный кухонный стол для готовки с дополнительными боковыми столиками по бокам и нижней полкой. Основная рабочая поверхность имеет ветрозащиту, добавляющей комфорт при готовке. Удобные подвесные шкафы с каждой стороны с 2 полками из жёсткого фибролита для кухонной утвари. Такая кухня создаст непревзойдённый комфорт не только в длительных путешествиях или в базовом лагере, но и может послужить на даче. Максимально простая установка.',
          userId: 4,
          catEId: 4,
          pathImg: 'kuxnya.jpeg',
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          name: 'Водка Grey Goose 0.7 л',
          price: 400,
          description: 'Грей Гус (Grey Goose) Изысканная водка Грей Гус по праву считается самой вкусной водкой в мире, являясь лидером среди крепких напитков в классе ультра-премиум. Впервые приняв участие в престижном мировом чемпионате World Spirits Championship 1997 года, она сразу же была отмечена титулом World’s Best Tasting Vodka и завоевала платиновую медаль. А в 2001 году была награждена золотой медалью на соревновании между водками класса ультра-премиум. За уникальной рецептурой создатель водки Грей Гус – Сидни Франк последовал во Францию, на родину самых изысканных вин и коньяков, где лучшие мастера создали напиток с поистине исключительным вкусом. Все этапы её производства осуществляются в провинции Коньяк, где для изготовления спирта используются только отборные сорта пшеницы, ржи и ячменя, выращенные в лучших районах Франции. После пятикратной дистилляции, спирт приобретает необыкновенную мягкость, а чистейшая ледниковая вода из артезианских скважин французских Альп дарит ей свежее и ясное звучание. В России водка Грей Гус появилась в 2007 году, сразу завоевав признание у знатоков и ценителей по-настоящему качественной продукции.',
          userId: 4,
          catEId: 5,
          pathImg: 'vodka.webp',
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          name: 'Сигареты интересные',
          price: 140,
          description: 'Сигареты с никотином',
          userId: 4,
          catEId: 5,
          pathImg: 'blants.webp',
          createdAt: new Date(),
          updatedAt: new Date(),
        },
      ],
      {},
    );
  },

  down: async (queryInterface, Sequelize) => {
    await queryInterface.bulkDelete('Equipment', null, {});
  },
};